basic/controllers/EmployeeController.php

    protected function findModel($id)
    {
        if (($model = Employee::findOne($id)) !== null) {
---
SELECT * FROM `employee` WHERE `id`='1'